[
    {
        "id": 1,
        "name": "National Agriculture Scholarship",
        "income_threshold": "INR 1,50,000",
        "description": "A scholarship program aimed at providing financial support to the children of farmers pursuing higher education in agriculture-related fields.",
        "eligibility_criteria": "Children of farmers with an annual family income below INR 1,50,000; Must have secured at least 60% in the last qualifying examination.",
        "benefits": "Full tuition fee coverage; Monthly stipend of INR 2,000.",
        "states": ["All States"]
    },
    {
        "id": 2,
        "name": "Krishi Vidya Yojana",
        "income_threshold": "INR 2,00,000",
        "description": "A government scheme to promote agricultural education among the children of farmers by providing financial assistance.",
        "eligibility_criteria": "Must be a child of a farmer; Annual family income should not exceed INR 2,00,000; Must be enrolled in an agricultural university or college.",
        "benefits": "Scholarship of INR 50,000 per year; Additional INR 10,000 for books and materials.",
        "states": ["All States"]
    },
    {
        "id": 3,
        "name": "Farmers' Child Education Scheme",
        "income_threshold": "INR 1,75,000",
        "description": "A scheme designed to assist the children of farmers in obtaining quality education without financial burdens.",
        "eligibility_criteria": "Open to children of small and marginal farmers; Family income must be less than INR 1,75,000 per annum.",
        "benefits": "Annual scholarship of INR 25,000; Special coaching for competitive exams.",
        "states": ["All States"]
    },
    {
        "id": 4,
        "name": "Agri-Scholarship for Higher Studies",
        "income_threshold": "INR 2,50,000",
        "description": "This scholarship aims to support the higher education of farmers' children in various disciplines, with a preference for agricultural studies.",
        "eligibility_criteria": "Children of farmers; Annual family income should be below INR 2,50,000; Must have scored 70% or above in the previous academic year.",
        "benefits": "Coverage of 75% of tuition fees; Monthly stipend of INR 1,500 for living expenses.",
        "states": ["All States"]
    },
    {
        "id": 5,
        "name": "Kisan Shiksha Yojana",
        "income_threshold": "INR 1,00,000",
        "description": "A government initiative to ensure the education of farmers' children by providing financial assistance and resources.",
        "eligibility_criteria": "Children of farmers with a family income below INR 1,00,000; Must be enrolled in school or college.",
        "benefits": "Annual financial aid of INR 30,000; Free access to online educational resources.",
        "states": ["All States"]
    },
    {
        "id": 6,
        "name": "Rural Education Promotion Scheme",
        "income_threshold": "INR 2,00,000",
        "description": "A scheme focused on promoting education among the rural farming community by providing scholarships to their children.",
        "eligibility_criteria": "Must be a child of a farmer residing in a rural area; Family income should not exceed INR 2,00,000 per annum.",
        "benefits": "Scholarship of INR 20,000 per year; Free textbooks and study materials.",
        "states": ["All States"]
    },
    {
        "id": 7,
        "name": "AgriTech Scholarship",
        "income_threshold": "INR 2,20,000",
        "description": "A scholarship for children of farmers to pursue education in technology and innovation in agriculture.",
        "eligibility_criteria": "Children of farmers with a family income under INR 2,20,000; Must be pursuing a degree in agriculture technology.",
        "benefits": "Tuition fee waiver up to INR 60,000 per year; Internship opportunities in agri-tech companies.",
        "states": ["All States"]
    },
    {
        "id": 8,
        "name": "Farmer's Future Scholarship",
        "income_threshold": "INR 1,50,000",
        "description": "A scholarship aimed at supporting the children of farmers in pursuing any field of higher education.",
        "eligibility_criteria": "Children of farmers; Annual family income below INR 1,50,000; Must have passed the previous academic year with 65% marks.",
        "benefits": "Scholarship of INR 40,000 per year; Mentorship programs for career guidance.",
        "states": ["All States"]
    },
    {
        "id": 9,
        "name": "Kisan Vikas Yojana",
        "income_threshold": "INR 1,80,000",
        "description": "A scheme to enhance the educational opportunities for farmers' children and ensure their holistic development.",
        "eligibility_criteria": "Children of farmers with a family income under INR 1,80,000; Must be enrolled in a recognized educational institution.",
        "benefits": "Annual scholarship of INR 35,000; Free educational workshops and seminars.",
        "states": ["All States"]
    },
    {
        "id": 10,
        "name": "AgriPride Scholarship",
        "income_threshold": "INR 2,50,000",
        "description": "A scholarship to support the higher education of children of farmers in prestigious institutions.",
        "eligibility_criteria": "Children of farmers; Family income below INR 2,50,000 per annum; Must have secured admission in a reputed college.",
        "benefits": "Scholarship covering 80% of tuition fees; INR 15,000 annual allowance for books and materials.",
        "states": ["All States"]
    },
    {
        "id": 11,
        "name": "Green Future Scholarship",
        "income_threshold": "INR 1,70,000",
        "description": "A program to support the education of farmers' children with a focus on environmental and agricultural studies.",
        "eligibility_criteria": "Children of farmers; Family income below INR 1,70,000; Enrolled in a course related to agriculture or environment.",
        "benefits": "Scholarship of INR 25,000 per semester; Opportunities for field trips and practical training.",
        "states": ["All States"]
    },
    {
        "id": 12,
        "name": "AgriGold Scholarship",
        "income_threshold": "INR 2,00,000",
        "description": "A scholarship to support meritorious students from farmers' families in pursuing higher education.",
        "eligibility_criteria": "Children of farmers; Annual family income should not exceed INR 2,00,000; Must have excellent academic records.",
        "benefits": "Scholarship of INR 50,000 per year; Special coaching for entrance exams.",
        "states": ["All States"]
    },
    {
        "id": 13,
        "name": "Krishi Pragati Yojana",
        "income_threshold": "INR 2,20,000",
        "description": "A government scheme to ensure educational support and financial aid to farmers' children.",
        "eligibility_criteria": "Children of farmers; Family income below INR 2,20,000; Must be enrolled in an educational program.",
        "benefits": "Annual scholarship of INR 30,000; Free access to online courses and resources.",
        "states": ["All States"]
    },
    {
        "id": 14,
        "name": "Farmers' Education Grant",
        "income_threshold": "INR 1,90,000",
        "description": "A grant to support the children of farmers in their educational pursuits, ensuring minimal financial burden.",
        "eligibility_criteria": "Children of farmers; Family income below INR 1,90,000; Must have a good academic record.",
        "benefits": "Annual grant of INR 40,000; Support for purchasing educational materials.",
        "states": ["All States"]
    },
    {
        "id": 15,
        "name": "AgriBright Scholarship",
        "income_threshold": "INR 1,60,000",
        "description": "A scholarship for the children of farmers to encourage and support their higher education.",
        "eligibility_criteria": "Children of farmers; Family income should be below INR 1,60,000; Must have scored at least 65% in the last exam.",
        "benefits": "Scholarship of INR 20,000 per semester; Free access to e-books and study guides.",
        "states": ["All States"]
    },
    {
        "id": 16,
        "name": "Kisan Uday Yojana",
        "income_threshold": "INR 2,00,000",
        "description": "A scheme aimed at providing financial assistance for the education of farmers' children.",
        "eligibility_criteria": "Children of farmers; Family income below INR 2,00,000; Enrolled in a recognized school or college.",
        "benefits": "Annual scholarship of INR 25,000; Free educational counseling services.",
        "states": ["All States"]
    },
    {
        "id": 17,
        "name": "AgriVision Scholarship",
        "income_threshold": "INR 2,40,000",
        "description": "A scholarship to support the vision of farmers' children pursuing higher education.",
        "eligibility_criteria": "Children of farmers; Annual family income below INR 2,40,000; Must be pursuing a degree in any field.",
        "benefits": "Tuition fee support up to INR 50,000 per year; Monthly allowance of INR 1,000.",
        "states": ["All States"]
    },
    {
        "id": 18,
        "name": "Krishi Suraksha Yojana",
        "income_threshold": "INR 2,10,000",
        "description": "A scheme aimed at ensuring the educational security of farmers' children through financial assistance.",
        "eligibility_criteria": "Children of farmers; Family income below INR 2,10,000; Must be pursuing education in an agricultural discipline.",
        "benefits": "Scholarship of INR 30,000 per annum; Career counseling and skill development workshops.",
        "states": ["All States"]
    },
    {
        "id": 19,
        "name": "Kisan Roshni Yojana",
        "income_threshold": "INR 1,80,000",
        "description": "A government initiative to provide educational scholarships to the children of farmers for a brighter future.",
        "eligibility_criteria": "Children of farmers; Annual family income should not exceed INR 1,80,000; Enrolled in an educational institution.",
        "benefits": "Annual scholarship of INR 35,000; Access to workshops on agricultural innovations.",
        "states": ["All States"]
    },
    {
        "id": 20,
        "name": "Green Harvest Scholarship",
        "income_threshold": "INR 2,30,000",
        "description": "A scholarship program focused on nurturing agricultural talents among the children of farmers.",
        "eligibility_criteria": "Children of farmers; Family income below INR 2,30,000; Must demonstrate interest and commitment to agriculture.",
        "benefits": "Scholarship covering 70% of tuition fees; INR 12,000 annual stipend for research projects.",
        "states": ["All States"]
    },
    {
        "id": 21,
        "name": "Maharashtra Kisan Shiksha Abhiyan",
        "income_threshold": "INR 1,50,000",
        "description": "A state-level scholarship program in Maharashtra aimed at supporting the education of farmers' children.",
        "eligibility_criteria": "Children of farmers residing in Maharashtra; Family income below INR 1,50,000; Enrolled in an educational institution.",
        "benefits": "Financial assistance up to INR 25,000 per year; Additional support for educational materials.",
        "states": ["Maharashtra"]
    },
    {
        "id": 22,
        "name": "Uttar Pradesh Kisan Utkarsh Yojana",
        "income_threshold": "INR 1,80,000",
        "description": "A scheme in Uttar Pradesh aimed at providing scholarships to children of farmers for higher education.",
        "eligibility_criteria": "Children of farmers from Uttar Pradesh; Family income should not exceed INR 1,80,000; Must be pursuing higher studies.",
        "benefits": "Scholarship amount varies based on course and institution; Support for competitive exam preparations.",
        "states": ["Uttar Pradesh"]
    },
    {
        "id": 23,
        "name": "Gujarat Krishi Sahay Yojana",
        "income_threshold": "INR 2,00,000",
        "description": "A scheme in Gujarat to provide financial assistance to the children of farmers pursuing agricultural education.",
        "eligibility_criteria": "Children of farmers from Gujarat; Family income below INR 2,00,000; Must be enrolled in an agricultural course.",
        "benefits": "Scholarship covering tuition fees and living expenses; Internship opportunities in agriculture.",
        "states": ["Gujarat"]
    },
    {
        "id": 24,
        "name": "Telangana Kisan Vidyarthi Abhiyan",
        "income_threshold": "INR 1,70,000",
        "description": "A state initiative in Telangana to support the education of farmers' children through scholarships.",
        "eligibility_criteria": "Children of farmers in Telangana; Family income below INR 1,70,000; Enrolled in a recognized educational institution.",
        "benefits": "Financial aid for tuition fees and educational expenses; Career guidance and skill development workshops.",
        "states": ["Telangana"]
    },
    {
        "id": 25,
        "name": "Madhya Pradesh Krishi Kalyan Yojana",
        "income_threshold": "INR 2,20,000",
        "description": "A scheme in Madhya Pradesh aimed at promoting agricultural education among the children of farmers.",
        "eligibility_criteria": "Children of farmers from Madhya Pradesh; Family income below INR 2,20,000; Must be pursuing education in agriculture.",
        "benefits": "Scholarship amount based on course and institution; Additional support for research projects.",
        "states": ["Madhya Pradesh"]
    }
]
